{"intents":[
    {
        "tag":"presidenteAmerica",
        "id":1,
        "patterns":[
            "Quem é o presidente da planta Bosch América Latina",
            "bosch presidente américa latina",
            "presidente américa latina", "presidente brasil",
            "presidente bosch brasil",
            "bosch", "ceo america latina"
        ],
        "responses":[
            "Gastón Diaz Perez, 45 anos, assumiu a presidência da Robert Bosch América Latina em 2022. Graduado em Administracao de Empresas pela Pontifícia Universidade Católica da Argentina (UCA), Gastón possui MBA em Gestão pela Universidade Austral (IAE) em Buenos Aires. Iniciou no Grupo Bosch no programa de trainee executivo em 2000 e desenvolveu sua carreira internacional ocupando diferentes posições nas áreas financeiras e comerciais na Argentina, Espanha, Brasil e Alemanha."
        ]
    },
    {
        "tag":"presidenteBosch",
        "id":2,
        "patterns":[
            "Quem é o presidente/CEO da Bosch",
            "presidente bosch mundo","ceo bosch",
            "presidente bosch mundial", "mundial",
            "ceo bosch mundo"
        ],
        "responses":[
            "O Doutor Stefan Hartung, presidente do conselho de administracao e acionista da Robert Bosch, G1 desde 1 de janeiro de 2022. Suas responsabilidades incluem estrategia corporativa, comunicacoes corporativas, assuntos gover namentais e desenvolvimento de tecnologia. Ele tambem responsavel pela pesquisa corporativa, engenharia avancada, gerenciamento de qualidade corporativa e pelo departamento corporativo de Fabricacao de Tecnologia."
        ]
    },
    {
        "tag":"RobertBosch",
        "id":3,
        "patterns":[
            "Quem foi Robert Bosch",
            "fundou", "fundador",
            "robert bosch"
        ],
        "responses":[
            "August Robert Bosch nasceu em Albeck, 23 de setembro de 1861 e morreu em 12 de março de 1942. Foi um industrial e inventor alemão, fundador da Robert Bosch. Estudou nos Estados Unidos. Passou mais de sete anos trabalhando em diversas empresas, trabalhando até mesmo com Thomas Edison em Nova York, e no Reino Unido para a empresa alemã Siemens. Em 1886 fundou uma oficina de mecânica de precisão e engenharia elétrica, que em 1937 tornou-se a Robert Bosch. Deve-se a ele o desenvolvimento da ignicao por magneto e da bomba de injecao para motores a diesel."
        ]
    },
    {
        "tag":"historiaBosch",
        "id":4,
        "patterns":[
            "Qual é a história da Bosch",
            "historia", "historia bosch"
        ],
        "responses":[
            "A Empresa Bosch teve o seu inicio com seu fundador Robert Bosch em 1886 com a abertura de uma oficina mecanica de precisao e engenharia eletrica em Stuttgard Alemanha. A partir de 1897, Robert Bosch começou a instalar dispositivos de ignicao de melhor design em automóveis e se tornou o único fornecedor de ignicao verdadeiramente confiavel. Em 1902, o engenheiro-chefe da Bosch, Gottlob Honold, apresentou uma solucao ainda melhor: o sistema de ignicao de alta tensao com vela de ignicao. Esse produto abriu caminho para a Bosch se tornar um fornecedor lider mundial no mercado automotivo. Em 1901 foi construida a primeira fabrica da Bosch que se expandiu para prédios vizinhos, dai em diante a Bosch só cresceu como empresa e negócio de sucesso."
        ]
    },
    {
        "tag":"cracha",
        "id":5,
        "patterns":[
            "Onde devolvo o cracha provisório",
            "crachá provisório", "crachá temporário",
            "perdi o crachá","devolver crachá"
        ],
        "responses":[
            "O crachá provisório deve ser devolvido na portaria 4 no momento em que você estiver saindo da Bosch. Lembre-se de que o crachá não deve ser retirado da planta."
        ]
    },
    {
        "tag":"vsdia",
        "id":6,
        "patterns":[
            "O que é VsDia",
            "vsdia"
        ],
        "responses":[
            "O VsDia se trata de uma metodologia de estudo de caso, ela é utilizada antes de iniciar um projeto que vai aprimorar ou interferir em uma linha de processos já existentes. Essa ferramenta ajuda no planejamento, cálculo de horas de trabalho, e divisão de tarefas. O diagrama geralmente é desenvolvido utilizando o software do Excel."
        ]
    },
    {
        "tag":"boschBrasil",
        "id":7,
        "patterns":[
            "Há quantos anos a Bosch está no Brasil",
            "bosch ta no brasil há quanto tempo",
            "bosch brasil"
        ],
        "responses":[
            "Em 1959 a Bosch se transferiu para Campinas, São Paulo, inaugurando ali sua primeira fábrica no Brasil para produzir autopeças."
        ]
    },
    {
        "tag":"ets",
        "id":8,
        "patterns":[
            "O que significa ETS",
            "ets o que é","significado",
            "significado ets","ets"
        ],
        "responses":[
            "ETS se trata da sigla em inglês para Escola Técnica de Engenharia. A ETS todos os anos integra diversos aprendizer na empresa da Bosch para poderem adquirir conhecimentos relacionados a um dos cursos do Senai, assim garantindo que os profissionais que estão atuando na planta tenham qualificacao e conhecimento técnico referente ao mundo empresarial."
        ]
    },
    {
        "tag":"boschMundo",
        "id":9,
        "patterns":[
            "Quantas Bosch existem no mundo",
            "numero de bosch no mundo"
        ],
        "responses":[
            "A bosch tem 440 subsidiárias e empresas regionais em mais de 60 países com parceiros de vendas e serviços em aproximadamente 150 países espalhados pelo mundo."
        ]
    },
    {
        "tag":"colaboradores",
        "id":10,
        "patterns":[
            "Quantos colaboradores da Bosch existem no Brasil",
            "quantas pessoas trabalham na bosch brasil",
            "colaboradores brasil", "numero colaboradores"
        ],
        "responses":[
            "Com mais de 65 anos de história com o Brasil, Grupo Bosch emprega atualmente no país cerca de 8.800 colaboradores."
        ]
    },
    {
        "tag":"atuacaoBosch",
        "id":11,
        "patterns":[
            "O que a Bosch faz",
            "bosch produz o que", "o que produz"
        ],
        "responses":[
            "A Bosch atua em diferentes ramos da industria. Entre elas ela se contra desenvolvendo acessórios e ferramentas elétricas, negócios industriais, sistemas de segurança, soluções técnicas para manufatura, tecnologia de acionamento e controle, soluções de software e ainda atuando entre outros ramos."
        ]
    },
    {
        "tag":"instrutoresEts",
        "id":12,
        "patterns":[
            "Quem são os instrutores da ETS",
            "quem da aula na ets", "instrutores ETS"
        ],
        "responses":[
            "Atualmente a Bosch tem 8 instrutores efetivados. Sendo esse responsáveis por diferentes cursos e aulas dentro da ETS. Eles são Cleber Augusto, Leonardo Oliveira, Vanessa Mendes, Tiago Croda, Edmar Ianella, Lucas Dias, Francis Franquini e Roberta Costa."
        ]
    },
    {
        "tag":"objetivo",
        "id":13,
        "patterns":[
            "Qual é o seu objetivo como assistente virtual",
            "pra que voce serve", "voce serve pra que",
            "seu objetivo"
        ],
        "responses":[
            "O meu objetivo é tirar as dúvidas dos colaboradores da Bosch acerca da empresa. Assim ajudando a criar um ambiente mais familiar e confortável para todos. Além disso, tenho ferramentas de localizacao e agendamentos que podem ser utilizadas para ajudar no gerenciamento da ETS."
        ]
    },
    {
        "tag":"welcome",
        "id":14,
        "patterns":[
            "epa", "ei",
            "oie", "fala ai",
            "oi", "e ai","oii",
            "saudações", "opa",
            "oi bom dia", "olá",
            "oi como vai?", "olá tudo bem?",
            "oi boa noite", "boa tarde",
            "como vai?", "opa",
            "saudações!", "oioi",
            "iniciar"
        ],
        "responses":[
            "Olá, boas vindas!\n Eu sou Ávila!\n Sou uma assistente virtual criada por aprendizes da ETS para te ajudar a sanar dúvidas frequentes. \nComo posso te ajudar?"
        ]
    },
    {
        "tag":"ramal",
        "id":15,
        "patterns":[
            "ramal", "ramais",
            "contato", "telefone",
            "numero", "ambulatorio",
            "ambulatório",
            "portaria", "fcm",
            "bombeiros", "fretados"
        ],
        "responses":[
            "Vou listar pra você cinco ramais da bosch.\n Ramal do ambulatório: 21031416\n Ramal dos bombeiros: 21031234.\n Ramal dos fretados: 21033915.\nPortaria  4: 21032142\nFCM: 21032142"
        ]
    },
    { 
        "tag":"ponto",
        "id":16,
        "patterns":[
            "horario do ponto", "bater ponto",
            "horario saida", "horario entrada",
            "hora de bater ponto", "entrada", "saida","ponto"
        ],
        "responses":[
            "Os horários para aprendizes da manhã são: Entrada 07:25 às 07:30\nSaída às 11:30 até às 11:35.\n Para aprendizes da tarde: entrada às 12:5 até às 13:00\n. Saída às 17:00 até às 17:05. Caso tenha batido o ponto fora desse horário, por favor, notifique o Edmar Ianella."
        ]
    },
    {
        "tag":"regras",
        "id":17,
        "patterns":[
            "normas da empresa","normas",
            "regras da empresa","regras"
        ],
        "responses":[
            "Na bosch não é permitido correr na planta.\n Não é permitido andar utilizando o celular ao mesmo tempo.\n Não traga materiais de casa como notebook sem a nota fiscal e o workon.\n Sempre atravesse na faixa de pedestre, entre outras normas."
        ]
    },
    {
        "tag":"epi",
        "id":18,
        "patterns":[
            "epi","equipamentos",
            "pedir epi", "pegar epi"
        ],
        "responses":[
            "Na planta possuímos tótens de EPI. Para retirá-los basta passar o crachá no sensor, selecionar um produto e clicar em Emissão."
        ]
    },
    {
        "tag":"medicamento",
        "id":19,
        "patterns":[
            "reembolso de medicamento","medicamento",
            "reembolso de remédio", "reembolso",
            "comprei um remedio e quero reembolso",
            "como receber reembolso de um remédio",
            "remedio","remédio"
        ],
        "responses":[
            "Para conseguir reembolso de um medicamento, você precisará da sua receita médica e da nota fiscal de compra do remédio.\n Grampeie esses dois documentos e escreva no verso na receita seu nome completo EDV, telefone e e-mail.\n Após isso, deposite esses documentos nas caixinhas disponíveis nas portarias."
        ]
    },
    {
        "tag":"5s",
        "id":20,
        "patterns":[
            "o que é 5s", "5s",
            "metodologia 5s"
        ],
        "responses":[
            "O 5s é uma metodologia utilizada para promover e alcançar a melhoria contínua e a qualidade total. Na ETS o 5S é aplicado na segunda de manhã na oficina, salas de aula e ambiente de convivência. No BTC essas metodologias também devem ser aplicadas nas salas 1, 2 e 3. Na quarta-feira à tarde deve ser feito o mesmo processo"       
        ]
    },
    {
        "tag":"numeroBoschBrasil",
        "id":21,
        "patterns":[
            "quantas bosch tem no brasil","no brasil tem quantas bosch?",
            "quantas empresas bosch tem no brasil?", "quantas plantas nacionais existem?"
        ],
        "responses":[
            "Atualmente no Brasil existem 17 unidades da Bosch, sendo que 9 se encontram no estado de São Paulo, uma em Minas Gerais, uma na Bahia, outra em Pernambuco, 3 no Paraná e duas em Santa Catarina."
        ]
    },
    {
        "tag":"polimorfismo",
        "id":22,
        "patterns":[
            "O que é polimorfismo?","polimorfismo"
        ],
        "responses":[
            "Polimorfismo é um conceito da programacao orientada a objetos, que se refere a objetos de diferentes classes terem o mesmo método ou operacao de maneira diferente. Existem dois tipos: Um é polimorfismo estático ou sobrecarga, quando duas ou mais funções tem o mesmo nome, porém, parâmetros diferentes. O outro é o polimorfismo dinâmico ou sobrescrita, quando uma subclasse substitui um método que está na superclasse, alterando ou estendendo seu comportamento"
        ]
    },
    {
        "tag":"herança",
        "id":23,
        "patterns":[
            "o que é herança?","herança","heranca"
        ],
        "responses":[
            "Herança é a capacidade de uma subclasse de ter acesso as propriedades da superclasse. Exemplo: A superclasse Mamifero possui duas subclasses: Gato e cachorro, ambos possuem os mesmos atributos pois herdam da superclasse mamifero (como pelos e glândulas mamárias) e também tem seus atributos individuais (como miar e latir). Sua maior vantagem é a reutilizacao de código. "
        ]
    },
    {
        "tag":"pagBoschZunder",
        "id":24,
        "patterns":[
            "Onde acho a página do Bosch zunder?","bosch zunder"
        ],
        "responses":[
           "Você pode abrir qualquer navegador e clicar no icone de casa ao lado da barra de endereços. "  
        ]
    },
    {
        "tag":"definicaoPOO",
        "id":25,
        "patterns":[
            "o que é orientado a objetos?", "o que é poo",
            "poo", "orientação a objetos", "programação orientada"
        ],
        "responses":[
           "O termo orientacao a objetos significa organizar o mundo real como uma colecao de objetos que são organizados em classes, cujo possuem métodos. Por exemplo: temos um carro civic cor preta e um carro hrv cor prata, ambos aceleram e freiam. O carro é a classe cujo possui modelo, cor e suas ações. Cada carro é um objeto onde é especificado qual modelo, cor e como executa essas ações. De forma mais simples, é um conceito que está relacionado com a ideia de classificar, organizar e abstrair coisas. "  
        ]
    },
    {
        "tag":"definicaoCOMPILADO",
        "id":26,
        "patterns":[
            "o que é compilado?","compilação"
        ],
        "responses":[
           "Linguagem compilada é uma linguagem de programacao em que o código fonte, nessa linguagem, é executado diretamente pelo sistema operacional ou pelo processador, após ser traduzido por meio de um processo chamado compilacao, usando um programa de computador chamado compilador, para uma linguagem de baixo nível, como linguagem de montagem ou código de máquina. "  
        ]
    },
    {
        "tag":"diferencaCOMPILADO",
        "id":27,
        "patterns":[
            "qual a diferença de compilado e interpretado?","interpretado"
        ],
        "responses":[
           "Na compilacao, o compilador irá ler o código, fazer todas as análises sintáticas e demais processos, para, por fim, gerar um arquivo código-objeto ou um arquivo executável (exemplo: c). Já na interpretacao, nenhum arquivo ou código é gerado, e sim uma traducao instantânea, em tempo de execucao (exemplo: python) "  
        ]
    },
    {
        "tag":"classes",
        "id":28,
        "patterns":[
            "o que são classes","classes orientado a objeto",
            "o que é classe em java"
        ],
        "responses":[
           "Sendo aplicadas durante a programacao orientada a objetos as classes tem como funcao definir o formato destes objetos e, além disso, definir como esse objeto se comunicará com o resto da aplicacao. Estes objetos da programacao, assim como os da vida real possuem características e comportamentos característicos. Em programacao chamamos estas características de atributos e estes comportamentos de métodos. "  
        ]
    },
    {
        "tag":"construtor",
        "id":29,
        "patterns":[
            "o que é construtor", "o que são construtores",
            "método construtor"
        ],
        "responses":[
           "São métodos especiais que servem para construir e inicializar instâncias de uma classe (novos objetos). Em geral os construtores são responsáveis por atribuir valores iniciais para os atributos do novo objeto que está sendo criado, mas eventualmente pode ser necessário algum processamento adicional que vai além da inicializacao de atributos. "  
        ]
    },
    {
        "tag":"graficoPowerBI",
        "id":30,
        "patterns":[
            "como fazer um gráfico no powerbi?","gráficos no powerbi"
        ],
        "responses":[
           "São cinco passos: O primeiro deles é abrir o programa em sua máquina; o segundo é importar a planilha desejada, seja Excel ou SQL Server; o terceiro passo é clicar nas opções de gráficos disponíveis ao lado direito da tela, o penúltimo passo é selecionar quais colunas e informações deseja como o eixo ou a legenda, e por fim o último passo é clicar no ícone de pincel e estilizar! "  
        ]
    },
    {
        "tag":"tratarDadosPowerBI",
        "id":31,
        "patterns":[
            "como tratar os dados no powerbi", "tratamento de dados no powerbi"
        ],
        "responses":[
           "Através do Transform Data é possível inserir novas fontes de dados, excluir ou alterar planilhas, colunas e linhas. Para encontrá-lo é só ir na página inicial, a funcionalidade estará na faixa de opções em queries. "  
        ]
    },
    {
        "tag":"imagensPowerBI",
        "id":32,
        "patterns":[
            "tem como usar imagens no powerbi","figuras powerbi","imagens powerbi"
        ],
        "responses":[
           "Para usar imagens no powerbi, vá para Insert na faixa de opções e em Elements clique em imagem e a selecione. Para adicionar ações, clique na imagem, do lado direito irá aparecer um menu de opções chamado Format, em Image clique em Action. "  
        ]
    },
    {
        "tag":"relacionamentoPowerBI",
        "id":33,
        "patterns":[
            "como fazer relacionamentos no powerbi","como fazer relações no powerbi?"
        ],
        "responses":[
           "Clique em Model na página inicial do lado esquerdo (o terceiro icone). Depois lique em manage relationship na parte de relacionamentos na barra de ferramentas. Em seguida, clique em New e na primeira barra selecione qual a tabela deseja relacionar. Na segunda barra selecione a outra tabela a ser relacionada. Selecione as colunas que serão utilizadas para fazer o relacionamento clicando nelas, lembre-se: as colunas devem ter os mesmos dados (exemplo: coluna de id). Por fim, clique em OK. "  
        ]
    },
    {
        "tag":"programarMelhor",
        "id":34,
        "patterns":[
            "dicas para ser um melhor programador", "como posso melhorar minha programação"
        ],
        "responses":[
           "Buscar conhecimento todos os dias, seja por meio do estudo teorico ou prático. É muito importante a prática de exercícios sobre os assuntos aprendidos, para que eles se fixem na mente, alguns sites para treinar são: HackerRank, LeetCode ou Codeforces  Esteja apto a receber feedbacks buscando constante evolucao. Pergunte aos colegas como eles resolveriam tal problema, para aprender as diversas maneiras. "  
        ]
    },
    {
        "tag":"automacao",
        "id":35,
        "patterns":[
            "quais as principais ferramentas de automação que a Bosch tem?","bosch automação"
        ],
        "responses":[
           "Power BI, AutomationAnywhere, VsDIA, Catalytic e PowerAutomate são as principais ferramentas de automacao usadas na Bosch"  
        ]
    },
    {
        "tag":"composição",
        "id":36,
        "patterns":[
            "o que é composicao", "composicao","composição"
        ],
        "responses":[
           "A Composicao ou Agregacao faz o reaproveitamento (reutilizacao) de classes utilizado pela programacao orientada a objetos para aumentar a produtividade e a qualidade no desenvolvimento de software. Basicamente, é quando uma classe está composta de várias outras, exemplo: um carro é composto por: rodas, motor, pneus, direcao etc. "  
        ]
    },
    {
        "tag":"duvidasPessoais",
        "id":37,
        "patterns":[
            "será que estou na área certa?", "me sinto perdido",
            "nao sei se quero trabalhar com isso","quero sair do curso",
            "quero desistir do curso","nao quero continuar curso"
        ],
        "responses":[
           "De jovem para jovem, quero te fazer refletir sobre umas coisas. O primeiro ponto é de que apesar muitas pessoas considerarem normal, você fica no piloto automático com frequência? O que te faz ficar assim são as atividades que realiza ou o ambiente em que está? porque veja bem, se você é o profissional que passa os dias contando as horas para chegar em casa, algo com certeza está errado. Outro ponto é se existe aquela positividade boa ou você passa o dia inteiro de mal humor comprometendo sua produtividade. Tenha sempre em mente que quando atuamos em uma área que nos trás satisfacao diária, existem planos frequentes de crescer na carreira. "  
        ]
    },
    {
        "tag":"api",
        "id":38,
        "patterns":[
            "o que posso usar para fazer uma API","ferramentas api","api"
        ],
        "responses":[
           "Para Node.js existe o framework Express.js, que permite criar APIs RESTful rapidamente e de maneira simples. Para Python existe o Django Rest Framework, que possui bons recursos para autenticacao e serializacao dos dados. Para Java existe o Spring Boot que facilita o desenvolvimento de APIs RESTful de alto desempenho"  
        ]
    },
    {
        "tag":"dicasPowerBI",
        "id":39,
        "patterns":[
            "dicas para um melhor powerbi","como fazer um bom powerbi","dicas powerbi"
        ],
        "responses":[
           "Organizacao dos gráficos de acordo com seu contexto (ex: deixar tudo que se relaciona a X de um lado e perto um do outro) investir na clusterizacao (se possível). Sempre conversar com o cliente e mostrar a ele o powerbi, pois é ele quem tem que entender o que você está fazendo. "  
        ]
    },
    {
        "tag":"duvidasPessoais2",
        "id":40,
        "patterns":[
            "Estou me sentindo desanimado, o que devo fazer?",
             "estou me sentindo triste","triste","desanimado",
             "cabisbaixo","sem vontade de continuar","sem vontade"
        ],
        "responses":[
           "Posso te recomendar nossa psicóloga Izadora da ETS, ela fica disponível das 07:30 às 15:00 na sala dos instrutores. Temos também como agendar uma consulta através do aplicativo da UNIMED ou solicitarmos um plantão pelo e-mail do ambulatório. "  
        ]
    },
    {
        "tag":"duvidasPessoais3",
        "id":41,
        "patterns":[
            "onde encontro um psicólogo na bosch?","busco terapia",
            "preciso de psicóloga", "temos psicólogo","psicólogo",
            "terapia","psicologia"
        ],
        "responses":[
           "Posso te recomendar nossa psicóloga Izadora da ETS, ela fica disponível das 07:30 às 15:00 na sala dos instrutores. Temos também como agendar uma consulta através do aplicativo da UNIMED ou solicitarmos um plantão pelo e-mail do ambulatório. "  
        ]
    },
    {
        "tag":"encapsulamento",
        "id":42,
        "patterns":[
            "o que é encapsulamento?", "encapsulamento"
        ],
        "responses":[
           "O encapsulamento serve para modificar o acesso aos atributos e aos métodos de um objeto, garantindo que somente as classes apropriadas possam acessar as informações e ajuda a assegurar que os atributos e os métodos sejam usados de forma consistente e previsível. Para acessar os dados usamos getters e para modificar usamos os setters. "  
        ]
    },
    {
        "tag":"itensPerdidos",
        "id":43,
        "patterns":[
            "o que fazer se eu perder alguma coisa","perdi meu material"
        ],
        "responses":[
           "Fique atento aos grupos do WhatsApp, se possível, mande uma mensagem informando o objeto perdido. Os materiais perdidos fora da ETS são deixados na portaria. "  
        ]
    },
    {
        "tag":"pagamento",
        "id":44,
        "patterns":[
            "quais os dias do pagamento",
            "quando a gente recebe",
            "quando o salario ta na conta",
            "quando a gente recebe","salario vai cair quando",
            "quando cai o salario"
        ],
        "responses":[
           "Irei te informar apenas após meu mês de criacao, haha! Em Junho será no dia 14 e 29, Julho: 13 e 28, Agosto: 15 a 30, Setembro: 13 e 28, Outubro:   e 30, Novembro: 14 e 29 (junto a 1º parcela do décimo terceiro), e Dezembro: 13 (junto a nossa 2º parcela do décimo terceiro) e 28! "  
        ]
    },
    {
        "tag":"feriados",
        "id":45,
        "patterns":[
            "quais os feriados desse ano?","que dias a gente folga esse ano"
        ],
        "responses":[
           "No dia 08 de Junho teremos Corpus Christi, 07 de Setembro nossa independência do Brasil! 12 de Outubro nosso dia das crianças e Nossa Sra. Aparecida, em Novembro teremos Finados no dia 02 e Proclamacao da República no dia 15, e por fim o Natal no dia 25 de Dezembro. "  
        ]
    },
    {
        "tag":"redirecionarPowerbi",
        "id":46,
        "patterns":[
            "como clicar em um botao e ir pra outra página no powerbi",
            "Como fazer um botão para clicar e ir pra outra página no powerbi?",
            "como fazer redirecionamento com o powerbi"
        ],
        "responses":[
           "Você pode fazer o uso dos botões para fazer redirecionamento para outras páginas, para isso, adicione um botão  na aba ‘insert’ clicando em buttons, na aba de ‘format’ ative a action e escolha ‘page navigation’   e escolha a ‘destionation’ que quiser! "  
        ]
    },
    {
        "tag":"planilhasPython",
        "id":47,
        "patterns":[
            "como modificar planilhas no python","como fazer crud em planilha"
        ],
        "responses":[
           "Para fazer um crud basico no python, você precisa importar o pandas, é comum que se use a dominacao pd, (import pandas as pd), você também precisa uar o DataFrame para fazer as modificações. Analisei os videos do YouTube e te recomendo esse: https://youtu.be/C0aj3FjN5e0 "  
        ]
    },
    {
        "tag":"metodosHttp",
        "id":48,
        "patterns":[
            "metodos http","http","protocolo de comunicacao"
        ],
        "responses":[
           "O método HTTP nada mais é que um protocolo de comunicacao entre cliente-servidor, ou seja, de um lado, um navegador requisita um determinado dado, e do outro, um computador/servidor retorna a informacao desejada (ou não, caso ela não seja encontrada, ocorra um erro ou não exista mesmo). Este protocolo define oito métodos de requisicao que são GET, POST, PUT, DELETE, HEAD, TRACE, OPTIONS e CONNECT. "  
        ]
    },
    {
        "tag":"publicarPowerbi",
        "id":49,
        "patterns":[
            "publicar powerbi","publicar powerbi"
        ],
        "responses":[
           "Para publicar o powerbi, digite a seguinte URL na web: ‘https://powerbi.bosch.com/publish/’ Clique em Add Reports, na caixa de selecao escolha o nivel de segurança do seu powerbi (qualquer coisa deixa o SC-2, mas é bom saber o correto) Depois selecione o arquivo, preencha as informações e tudo certo! Já pode enviar o link aos interessados. "  
        ]
    },
    {
        "tag":"executavel",
        "id":50,
        "patterns":[
            "como fazer um programa ser executavel","como fazer um exe python",
            "como fazer um script executavel"
        ],
        "responses":[
           "Você pode fazer isso utlilizando o PyIntsaller, baixe ele no seu projeto (pip install pyinstaller) e no terminal digite ‘pyinstaller --onefile aqui_o_nome.py’, o arquivo será gerado em um diretório chamado ‘dist’, de lá você pode jogá-lo onde quiser! "  
        ]
    },
    {
        "tag":"workspacePowerBI",
        "id":51,
        "patterns":[
            "como fazer workspace para powerbi", "como crio powerbi no sharepoint"
        ],
        "responses":[
           "Para isso você precisa pedir o powerbi pro em IT Service Portal (o icone de IS na página do Bosch Zunder), pesquise por ‘Pro License for Power BI Cloud’, clique em ‘order for self’ preencha as informações e é só aguardar (pode demorar até uma semana!). Depois de ter o powerbi pro, vá no seu office 365 (pesquise por office 365 na web e faça o login) e clique em powerbi, depois em workspaces, crie uma nova com os interessados, suba o powerbi e mande o link para aqueles que estão na workspace. Para atualiza, você deve ir ao powerbi e clicar e ‘publish’, escolha a workspace e prontinho! "  
        ]
    },
    {
        "tag":"tecnologias",
        "id":52,
        "patterns":[
            "quais as tecnologias em alta no mercado"
        ],
        "responses":[
           "Estas estão sendo as maiores tendências tecnológicas: Inteligência Artificial (IA), Metaverso, Wireless com novas funções, plataformas de nuvem e desenvolvedores front e back-end. "  
        ]
    },
    {
        "tag":"hackathon",
        "id":53,
        "patterns":[
            "Quais os projetos ganhadores do hackathon?",
            "Hackathon ganhadores",
            "Quem ganhou o Hackathon?"
        ],
        "responses":[
            "No Hackathon de 2021 os ganhadores foram: o projeto TestQuest, Correcao Automática de provas por IA. No Hackathon de 2022 os ganhador foi o projeto Robosch, um ChatBot da ETS. No primeiro semestre de 2023 o projeto ganhador foi o Greenbo."
        ]
    },
    {
        "tag":"hardware",
        "id":54,
        "patterns":[
            "Como funciona e qual a importância de cada um dos componentes fundamentais de um computador?",
            "Me fala os hardwares de um computador",
            "Me fala os hardwares de um computador por favor",
            "ÁViila como funciona os hardwares de um pc?",
            "Quais são os componentes principais de um pc?",
            "Quais são os componentes principais de um computador?",
            "Descreva os componentes do computador",
            "Componentes de computador",
            "Componentes de um computador"
        ],
        "responses":[
            "Bom, a sua resposta vai ser um pouco longa hahaha, temos a Placa Mãe, ela é como uma central do computador/noteboook, onde as informações são coletadas e difundidas através desse união de todas as partes do seu Sistema Operacional. Ela se conecta com a placa de vídeo, os pentes de memória, o processador, e o HD por exemplo! Agora o processador..bem, ele é o responsável pela execucao de instruções do sistema do seu computador, ou seja, vai executar os comandos dados à máquina. Nosso HD tem a funcao de armazenar todos os arquivos e informações do seu computador, permitindo o seu funcionamento. Nossa Memória RAM armazenada é diferente ao HD, pois ela é uma memória temporária do seu computador. Temos a Placa de Vídeo e a Fonte de Alimentacao, que recebe a energia da rede elétrica e a distribui aos componentes de seu computador. "
        ]
    },
    {
        "tag":"proxy",
        "id":55,
        "patterns":[
            "O que é proxy e para que serve?",
            "Me fala o que é proxy?",
            "Me fala o que é proxy por favor",
            "ÁVilla me explica esse proxy ai por favor",
            "ÁVilla proxy",
            "Proxy",
            "Apenas proxy"
        ],
        "responses":[
            "Um servidor proxy é uma ferramenta importante para sua privacidade, e está muito ligado ao que a palavra em inglês quer dizer: procuracao. Isto é, representa um certo tipo de autoridade dada a uma outra parte para agir em seu nome. Ele é uma ponte entre você e a internet. Quando você tenta acessar um site pelo seu dispositivo, o navegador envia uma requisicao ao servidor web deste site, o qual retorna com a página que você estava buscando. Assim, sem um proxy, você se comunica diretamente com a internet e com o servidor em que está hospedado o site que você deseja acessar."
        ]
    },  
    {
        "tag":"escopo",
        "id":56,
        "patterns":[
            "Qual a diferença entre Escopo global e local de variaveis?",
            "O que é variável global e local?",
            "Me explique escopo global e local por favor ÁVilla",
            "Me explique escopo global e local por favor",
            "Escopo global e local"
        ],
        "responses":[
            "Uma variável global é quando declaramos uma variável fora de qualquer funcao, se tornando acessível a qualquer parte da nossa aplicacao, podendo ser lida e alterada. Diferente da global, a variável local é quando declaramos dentro de uma funcao,assim ela se torna acessível somente dentro da funcao onde ela foi declarada."
        ]
    },
    {
        "tag":"informação",
        "id":57,
        "patterns":[
            "Quais os tres criterios de segurança da informação (cada um deles)",
            "Quais os critérios da segurança da informação?",
            "Quais os pilares da segurança da informação?"
        ],
        "responses":[
            "Os 3 pilares da segurança da informacao são Disponibilidade, Confidencialidade e Integridade. Disponibilidade: esse pilar está diretamente ligado à possibilidade de acesso às informações. Segundo ele, as informações precisam estar sempre à disposicao; Confidencialidade: segundo ele, o acesso as informações deve ser concedido apenas a quem tem permissão para acessá-las. Integridade: A informacao enviada deve permanecer sempre em sua natureza original. Não deve ser alterado durante o processo de transmissão."
        ]
    },
    {    
        "tag":"abstracao",
        "id":58,   
        "patterns":[
            "O que é abstracao?","abstração"
        ], 
        "responses":[
            "Na programacao de computadores ela é uma forma de reduzir a complexidade e tornar o projeto e a implementacao mais eficientes em sistemas complexos de software. Ela esconde a complexidade técnica de um sistema por trás de uma API mais simples."
        ]
    },
    {
        "tag":"modelagem",
        "id":59,
        "patterns":[
            "Qual a diferença entre modelagem lógica e conceitual?",
            "Modelagem conceitual e lógica",
            "O que é modelagem lógica e conceitual?"
        ],
        "responses":[
            "Na Modelagem Conceitual o objetivo é criar um modelo de forma gráfica, sendo este chamado de Diagrama Entidade e Relacionamento (DER), que identificará todos de forma global, sem qualquer detalhamento específico de um Banco de Dados. Sua principal finalidade é capturar os requisitos de informacao e regras de negócio sob o ponto de vista do negócio. Agora na Modelagem Lógica é principalmente associada à coleta de necessidades de negócios, e não ao design do banco de dados. Ele irá determinar se todos os requisitos do negócio foram coletados, sendo mais complexo que o Modelo COnceitual em que os tipos de coluna são definidos."
        ]
    },
    {
        "tag":"atribuição",
        "id":60,
        "patterns":[
            "Quando faço uma atribuição por valor e uma atribuição por referência?",
            "Como faço atribuições no JavaScript?",
            "Como faço atribuições?"
        ],
        "responses":[
            "Atribuições por valor é quando você faz, por exemplo, x = 5. Esta guardado na memoria o valor 5 no endereço reservado à variável X. Ao fazer *y = x estamos dizendo que o ponteiro y vai guardar na memoria o endereço da variavel X, ou seja, estamos referenciando X"
        ]
    },
    {
        "tag":"BD",
        "id":61,
        "patterns":[
            "Quais os bancos de dados mais utilizados?",
            "Me fale os bancos de dados mais usados por favor"
        ],
        "responses":[
            "Listei os dez sistemas de banco de dados mais utilizados para você: ORACLE DATABASE, MYSQL, SQL SERVER, POSTGRESQL, IMB DB2, MICROSOFT ACCESS, SQLITE, MARIADB, SNOWFLAKE e MICROSOFT AZURE."
        ]
    },
    {
        "tag":"servidor",
        "id":62,
        "patterns":[
            "O que é um servidor web?",
            "Como funciona um servidor web?",
            "Me explique o que é um servidor web por favor"
        ],
        "responses":[
            "Um Servidor web pode se referir ao hardware ou ao software, ou ambos trabalhando juntos. Referente ao hardware, ele é um computador que armazena arquivos que compõem os sites (por exemplo, documentos HTML, imagens e arquivos JavaScript) e os entrega para o dispositivo do usuário final. Está conectado a Internet e pode ser acessado através do seu nome de domínio (DNS). Já ao software, um servidor web inclui diversos componentes que controlam como os usuários acessam os arquivos hospedados (armazenados para disponibilizacao), no mínimo um servidor HTTP. Um servidor HTTP é um software que compreende URLs (endereços web) e HTTP (o protocolo que seu navegador utiliza para visualizar páginas web."
        ]
    },
    {
        "tag":"aplicação", 
        "id":63,
        "patterns":[
            "Onde posso hospedar minha aplicacao?",
            "Após terminar meu projeto como posso hospedar ele?"
        ],
        "responses":[
            "Para hospedar uma aplicacao frontend você pode usar Vercel ou AWS Amplify. Para hospedar uma aplicacao backend você pode usar Render, Fly.io ou Railway.  "
        ]
    },
    {
        "tag":"PowerBI",
        "id":64,
        "patterns":[
            "Primeiros passos com Power BI",
            "Por onde devo começar no Power BI?",
            "Não sei nada de Power BI"
        ],
        "responses":[
            "Eu sei o que você esperava, apenas três ou quatro passos haha, mas o Power BI é uma ferramenta muito rica! Por isso, recomendo este vídeo detalhado do Power BI, desde sua instalacao a seu primeiro gráfico! Digite essa url no seu navegador: https://youtu.be/UFGe25gydxo"
        ]
    },
    {
        "tag":"VsDia",
        "id":65,
        "patterns":[
            "Primeiros passos com VsDia",
            "Por onde devo começar no VsDia?",
            "Não sei nada de VsDia",
            "VSDIA"
        ], 
        "responses":[
            "Nós já temos um belo tutorial para vocês! Aqui está S:PM/ter/ets/Inter_Setor/COMPARTILHADO/AULAS/DIGITAL_SOLUTIONS/DIGITAL_SOLUTIONS_04/VSDIA"
        ]
    },
    {
        "tag":"relatório",
        "id":66,
        "patterns":[
            "Como faço para criar um relatório no Power BI?",
            "Como eu crio um relatório no Power BI?"
        ],
        "responses":[
            "No painel de navegacao no serviço do Power BI, você pode selecionar o botão Criar, que abre uma página em que você pode selecionar sua fonte de dados. Isso também pode ser acessado no botão Novo relatório na página inicial. "
        ]
    },
    {
        "tag":"compartilhar",
        "id":67,
        "patterns":[
            "Como compartilhar meu Power BI com outras pessoas?",
            "Quero compartilhar meu Power BI, como faço isso?"
        ],
        "responses":[
            "Para isso você precisa publicar o powerbi, digite a seguinte URL na web: https://powerbi.bosch.com/publish/ Clique em Add Reports, na caixa de selecao escolha o nivel de segurança do seu powerbi (qualquer coisa deixa o SC-2, mas é bom saber o correto) Depois selecione o arquivo, preencha as informações e tudo certo! Já pode enviar o link aos interessados."
        ]   
    },
    {
        "tag":"DAX",
        "id":68,
        "patterns":[
            "Como programar no Power BI?",
            "Qual a linguagem de programação do Power BI",
            "Power BI tem linguagem de programação?",
            "Power BI usa alguma linguagem?"
        ],
        "responses":[
            "Assim como no Excel, é possível realizarmos fórmulas no Power BI através do DAX (Data Analysis Expressions), a linguagem de programacao própria do Power BI"
        ]
    },
    {
        "tag":"Outlook",
        "id":69,
        "patterns":[
            "Como fazer um E-mail automático no Outlook?",
            "Como eu faço um E-mail automático no Outlook?"
        ],
        "responses":[
            "É mais simples do que imagina! Basta abrir seu Outlook e em seguida clicar em Arquivo no cabeçalho e selecionar ‘Respostas Automáticas’. Desta forma você pode escolher algumas configurações como horários e intervalo de tempo de envio."
        ]
    },
    {
        "tag":"Order",
        "id":70,
        "patterns":[
            "Como pedir um computador?",
            "Como solicito um computador?",
            "Como solicito um notebook?",
            "Como pedir um notebook?",
            "Como eu peço um notebook?",
            "Como eu peço um computador?"
        ],
        "responses":[
            "Para pedir um computador, você deve seguir os passos: 1- Acessar o Bosch Zunder, clicar no icone de IS ou pesquisar por IT Service Portal. 2- Na barra de pesquisa busque por ‘Request computer’, vai aparecer um card, se for para você clique em ‘Order for self’, se não em ‘Order for others’. 3 – Preencha as informações e clique em submit. As demais informações você receberá por email."
        ]
    },
    {
        "tag":"WorkOn",
        "id":71,
        "patterns":[
            "Como tirar meu WorkOn?",
            "Como retiro meu WorkOn?",
            "Tirar WorkOn",
            "como fazer workon","como criar workon",
            "como pedir workon"
        ],
        "responses":[
            "Para pedir um workon, você deve seguir os passos: 1- Acessar o Bosch Zunder, clicar no icone de IS ou pesquisar por IT Service Portal. 2- Na barra de pesquisa busque por ‘WorkON’, vai aparecer um card, se for para você clique em ‘Order for self’, se não em ‘Order for others’. 3 – Preencha as informações e clique em submit. As demais informações você recebrá por email."
        ]
    },
    {
        "tag":"diariamente",
        "id":72,
        "patterns":[
            "Como fazer um programa rodar todos os dias ou assim que eu ligar o pc?",
            "Como eu rodo um programa todos os dias ou assim que eu ligar o pc?",
            "Como eu rodo um programa em determinado horário?",
            "Como eu rodo um programa em um horário específico?"
        ],
        "responses":[
            "Para isso, você pode usar o agendador de tarefas do windows, pesquise por ele no menu iniciar. Depois clique em ‘criar tarefa básica’, preencha o nome e a descricao. Clique em avançar, escolha qual a recorrência (lembre-se, você precisa ligar o pc para que o programa rode!), clique em avançar, escolha ‘inicar um programa’ selecione qual, prossiga e conclua!"
        ]
    },
    {
        "tag":"adminstrativo",
        "id":73,
        "patterns":[
            "Como ativar acesso adminstrativo?",
            "Como eu consigo acesso adminstrativo?",
            "Como eu consigo acesso admin?"
        ],
        "responses":[
            "Para pedir acesso administrativo, você deve ir ao IT Service Portal (o icone de IS na pagina da Bosch Zunder) e pesquisar por Enable or Disable Permanent Administrative Rights, clicar em Order e preencher os campos, depois é só aguardar! Para ativá-lo, vá no IT Workspace Toolkit (o icone de ferramenta provavelmente no sue Desktop) e clique em ‘Habilitar Acesso Administrativo Temporário’, selecione o motivo e tudo pronto"
        ]
    },
    {
        "tag":"download",
        "id":74,
        "patterns":[
            "Nao estou conseguindo baixar um programa, o que faço?"
        ],
        "responses":[
            "Minhas sugestões são:  checar o espaço disponível em sua máquina, caso esteja tudo ok, faça o download do programa e o arraste para a área de trabalho. Se não for possível, habilite o acesso administrativo e tente novamente. Se o problema persistir, vá ao AppLocker no IT Workspace toolkit e desligue ou habilite baixa protecao e tente novamente."
        ]
    },
    {
        "tag":"instalação",
        "id":75,
        "patterns":[
            "Como pedir a instalação ou remoção de um programa no meu computador?",
            "Como eu peço para instalar um programa?",
            "Como eu peço para desinstalar um programa?"
        ],
        "responses":[
            "Vá até a página da Bosch Zunder ‘Access & Permissions’ e busque por ‘Add/Remove Software’. Preencha as informações de acordo e aguarde, pois pode levar um tempo."
        ]
    },
    {
        "tag":"HomeOffice",
        "id":76,
        "patterns":[
            "Como pedir acesso a Bosch em casa?",
            "Como eu peço acesso a Bosch para trabalhar Home Office?"
        ],
        "responses":[
            "Caso você já tenha o workon, vá até a página inicial da bosch zunder no IT Service Portal, lá você irá pesquisar por CoRASon: Corporate Remote Access Solution. Uma vez que esteja no seu usuário selecione Order e preencha as informações, caso peça para terceiros selecione Order for others. Agora chegamos ao último passo! Em sua casa acesso o Cisco AnyConnect; selecione LA Brazil e seu usuário."
        ]
    },
    {
        "tag":"inglês",
        "id":77,    
        "patterns":[
            "Como pedir acesso ao curso de inglês?",
            "Como eu consigo fazer o curso de inglês?",
            "Como eu faço o curso de inglês?"
        ],
        "responses":[
            "Converse com o gestor da sua área sobre o seu interesse no curso, se aprovado, siga os passos: na pagina da Bosch Zunder, clique no icone LP, pesquise por ‘portal de idiomas’, antes de terminar de digitar vai aparecer duas opções, clique na primeira. Após isso, na nova página clique em ‘tutorial: como solicitar o teste de idiomas’ e siga os passos!"
        ]
    },
    {
        "tag":"VPN",
        "id":78,       
        "patterns":[
            "Qual a diferença entre Proxy e VPN?",
            "Proxy e VPN tem diferença?",
            "VPN e Proxy é a mesma coisa?"
        ],  
         "responses":[
            "Embora uma VPN (Virtual Private Network) também possa ser usada para acessar serviços de outros países, e mascarar seu IP, ela cria uma rede privada criptografada, blindando totalmente os dados entre o computador do usuário e o servidor VPN. Já o proxy é apenas um intermediário entre você e a internet e não criptografa nada."
        ]
    },
    {
        "tag":"interface", 
        "id":79,
        "patterns":[
            "Para que servem interfaces em Java?",
            "O que é interface na Java?"
        ],
        "responses":[
            "Uma interface é similar a um contrato, através dela podemos especificar quais métodos as classes que implementam esta interface são obrigados a implementar."
        ]
    },  
    {
        "tag":"Enum", 
        "id":80,
        "patterns":[
            "Para que serve o Enum em java?",
            "O que o Enum do Java faz?"
        ],
        "responses":[
            "Habilita uma variável a ser configurada com valores costantes pré-definidos. Ao atribuir valores à variável durante a execucao do programa, somente são aceitos valores presentes da lista definida de ENUM. Usamos Enum sempre que precisamos representar um conjunto fixo de constantes, valores que são totalmente conhecidos na hora d compilacao do programa."
        ]
    },
    {
        "tag":"bosch", 
        "id":81,
        "patterns":[
            "quanos anos tem a bosch","idade bosch","anos bosch","anos","idade"
        ],
        "responses":[
            "A empresa foi fundada por Robert Bosch em Stuttgart, em 1886. Totalizando 136 anos em 2023"
        ]
    },
    {
        "tag":"ets", 
        "id":82,
        "patterns":[
            "cursos ets", "cursos","curso"
        ],
        "responses":[
            "A ETS possui 4 cursos: Mecatrônica, Manufatura Digital, Desenvolvimento de Sistemas e Administracao. Você pode saber mais sobre eles em Cursos ETS, na página de home."
        ]
    },
    {
        "tag":"ets", 
        "id":83,
        "patterns":[
            "henrique dona", "doná","henrique doná",
            "gestor ets", "quem é henrique doná"
        ],
        "responses":[
           "O gestor da ETS é o Henrique Doná, que também já foi gestor da equipe de planejamento central de manutencao (estoque de peças de reposicao e ferramentas), terceirizacao de usinagens não produtivas e gestor da equipe de coordenacao do TPM da Robert Bosch Campinas!"
        ]
    }
]}